import numpy as np

def neural_network(inp, weights):
    h1 = inp.dot(weights[0])  # Вход (2) - Слой 1 (3 нейрона)
    h2 = h1.dot(weights[1])   # Слой 1 (3) - Слой 2 (2 нейрона)
    h3 = h2.dot(weights[2])   # Слой 2 (2) - Слой 3 (3 нейрона)
    out = h3.dot(weights[3])  # Слой 3 (3) - Выход (2 нейрона)
    return out

# Входные данные
inp = np.array([23, 45])


# Слой 1: 2 входа - 3 нейрона (Матрица 2x3)
w1 = np.array([
    [0.4, 0.3, 0.6], 
    [0.1, 0.2, 0.2]
])

# Слой 2: 3 входа - 2 нейрона (Матрица 3x2)
w2 = np.array([
    [0.2, 0.4],
    [0.5, 0.1],
    [0.3, 0.6]
])

# Слой 3: 2 входа - 3 нейрона (Матрица 2x3)
w3 = np.array([
    [0.7, 0.5, 0.3],
    [0.4, 0.2, 0.8]
])

# Выходной слой: 3 входа - 2 выхода (Матрица 3x2)
w_out = np.array([
    [0.7, 0.3],
    [0.4, 0.5],
    [0.1, 0.9]
])

# Список всех слоев
weights = [w1, w2, w3, w_out]

# Вычисляем результат
prediction = neural_network(inp, weights)

print(f"Результат на выходе сети: {prediction}")